{
  "Home": "Home",
  "Sobre Mi": "About Me",
  "Habilidades": "Skills",
  "Exp. Laboral": "Work Experience",
  "Portafolio": "Portfolio",
  "Contacto": "Contact",
  "Web Developer & E-Commerse Expert": "Web Developer & E-Commerse Expert",


  "Sobre mi": "About me",
  "Hola, soy Jhon.": "Hi, I'm Jhon.",
  "Llevo alrededor de 6 años desarrollando aplicaciones web de forma activa y profesional, Me describo como alguien bastante analítico desde el punto de vista lógico. Me gusta probar y aprender nuevas tecnologías a medida que se van actualizando para comprobar si pueden ayudarme a optimizar mi trabajo y a su vez ofrecer mayor calidad.": "I have been developing web applications actively and professionally for about 6 years, I describe myself as someone quite analytical from a logical point of view. I like to try and learn new technologies as they are updated to see if they can help me optimize my work and in turn offer higher quality.",
  "Datos Personales": "Personal Data",
  "Cumpleaños": "Birthday",
  "Teléfono": "Phone",
  "Email": "Email",
  "Ubicación": "Location",
  "Status": "Status",
  "Contratado por": "Hired by",
  "Mis Intereses": "My Interests",
  "Juegos": "Games",
  "Viajes": "Travel",
  "Tecnología": "Technology",
  "Compras": "Shopping",
  "Big Data": "Big Data",
  "Comida": "Food",
  "Familia": "Family",
  "Arte": "Art",
  "Descargar CV": "Download CV",


  "Habilidades": "Skills",
  "Habilidades Técnicas": "Technical Skills",
  "Habilidades Personales": "Personal Skills",
  "Comunicación": "Communication",
  "Trabajo en equipo": "Teamwork",
  "Creatividad": "Creativity",
  "Concentración": "Concentration",
  "Aprendizaje": "Learning",
  "Resolución de Problemas": "Problem Solving",
  "Organización": "Organization",
  "Responsabilidad": "Responsibility",


  "Experiencia Laboral": "Work Experience",
  "Actualmente": "Currently",
  "Programador Web": "Web Developer",
  "Desarrollar aplicaciones web a medida, compatible con dispositivos móviles y SEO.": "Develop custom web applications, compatible with mobile devices and SEO.",
  "Desarrollar soluciones de e-commerse.": "Develop e-commerse solutions.",
  "Desarrollar aplicaciones para Android/IOS.": "Develop applications for Android / IOS.",
  "Analisis y resolución de problemas en códigos.": "Analysis and resolution of problems in codes.",
  "Gestión y mantenimiento de bases de datos MYSQL y SQL.": "Management and maintenance of MYSQL and SQL databases.",
  "Optimizar la seguridad de las APPs administradas.": "Optimize the security of the managed APPs.",
  "Creación de bot para hacer trade de criptomonedas (Web APP con Python)": "Creation of bot to trade cryptocurrencies (Web APP with Python)",
  "Desarrollar un algoritmo para detectar patrones financieros y enviar alertas de posibles operaciones a realizar.": "Develop an algorithm to detect financial patterns and send alerts of possible operations to be carried out.",
  "Implementación de Arbitrage entre más de 4 exchanges.": "Implementation of Arbitrage between more than 4 exchanges.",
  "Desarrollo de bot para Discord para comunicación directa con el cliente.": "Development of bot for Discord for direct communication with the client.",
  "Configuración de servidor Amazon AWS e implementación.": "Amazon AWS server configuration and implementation.",
  "Coordinador de Sala Situacional": "Situational Room Coordinator",
  "Desarrollar sistema automatizado para gestion de inventários (Aplicación web)": "Develop automated system for inventory management (Web application)",
  "Recolección, analisis y tratamiento de datos de todas las gerencias para presentar al presidente de la empresa": "Collection, analysis and treatment of data from all the management to present to the president of the company",
  "Asesorar a nivel tecnológico al Presidente de la Empresa": "Advise the President of the Company on a technological level",
  "Resolución de problemas técnicos": "Resolution of technical problems",
  "Admin. Sistemas": "Systems Admin.",
  "Mi trabajo principal consistía en velar por el buen funcionamiento del sistema de llamadas y reportes del CallCenter, resolución de problemas técnicos y reportes diarios.": "My main job was to ensure the proper functioning of the CallCenter's call and reporting system, resolution of technical problems and daily reports.",


  "Portafolio Reciente (Solo algunos ejemplos)": "Recent Portfolio (Only some examples)",
  "Tienda Online": "Online Store",
  "para": "for",
  "Módulo de pagos para": "Payment module for",
  "Página Web": "Web Page",
  "Módulo para": "Module for",
  "APP Android para gestión interna": "Android APP for internal management",


  "Su nombre": "Your name",
  "Teléfono": "Phone",
  "Su email": "Your email",
  "Asunto": "Subject",
  "Mensaje": "Message",
  "Enviar": "Send",


  "Esta web utiliza Cookies": "This website uses Cookies",
  "Personalizar": "Customize",
  "Aceptar todas": "Accept all",
  "Rechazar todas": "Reject all",
  "Guardar configuración": "Save configuration",
  "Ver cookies": "See cookies",
  "Cookies Técnicas": "Technical Cookies",
  "Hola, mi portafolio online utiliza algunas cookies para mejorar y optimizar el contenido que deseo mostrarte. No te preocupes, podrás volver a modificar tu configuración desde el footer de esta web cuando quieras.": "Hello, my online portfolio uses some cookies to improve and optimize the content that I want to show you. Don't worry, you can go back to modify your configuration from the footer of this website whenever you want.",
  "Estas cookies garantizan el buen funcionamiento de mi portafolio online, son usadas para ejecutar funciones vitales como por ejemplo la seguridad y la navegación. Por ese motivo son obligatorias.": "These cookies guarantee the proper functioning of my online portfolio, they are used to perform vital functions such as security and navigation. For that reason they are mandatory.",
  "Esta cookie es usada por Google Recaptcha, es necesaria para la seguridad y la integridad de mi portafólio online.": "This cookie is used by Google Recaptcha, it is necessary for the security and integrity of my online portfolio.",
  "Esta cookie es usada por mi portafolio online para recordar su desición sobre el uso de cookies y ajustar la web a su configuración de privacidad de datos.": "This cookie is used by my online portfolio to remember your decision about the use of cookies and adjust the website to your data privacy settings.",
  "Esta es una cookie de seguridad para firmar la cookie de política de cookies.": "This is a security cookie to sign the cookie policy cookie.",
  "Esta cookie es usada por Google Analytics para distinguir a los usuarios y me permite almacenar el numero de veces que mi portafolio online ha sido visitado.": "This cookie is used by Google Analytics to distinguish users and allows me to store the number of times my online portfolio has been visited.",
  "Son aquéllas que le permitirán acceder a mi portafolio online con algunas características predefinidas y que dependiendo de las características de su dispositiov y/o navegador, servirán para ofrecer un mejor servicio, sirven por ejemplo para configurar el idioma, para adaptar el contenido al navegador/dispositivo que está utilizando, para guardar su configuración regional, etc.": "They are those that will allow you to access my online portfolio with some predefined characteristics and that depending on the characteristics of your device and / or browser, they will serve to offer a better service, they serve for example to configure the language, to adapt the content to the browser / device you are using, to save your regional configuration, etc.",
  "Esta cookie propia de mi portafolio online y sirve para recordar el idioma que configuró.": "This own cookie of my online portfolio and serves to remember the language you configured.",
  "Cookies Analíticas": "Analytical Cookies",
  "Cookies de Personalización": "Personalization Cookies",
  "Detalles": "Details",


  "Revocar configuración de cookies": "Revoke cookie settings"

}