{
  "Home": "Home",
  "Sobre Mi": "About Me",
  "Habilidades": "Skills",
  "Exp. Laboral": "Work Experience",
  "Portafolio": "Portfolio",
  "Contacto": "Contact",
  "Web Developer & E-Commerse Expert": "Web Developer & E-Commerse Expert",


  "Sobre mi": "About me",
  "Hola, soy Jhon.": "Hi, I'm Jhon.",
  "Llevo alrededor de 6 años desarrollando aplicaciones web de forma activa y profesional, Me describo como alguien bastante analítico desde el punto de vista lógico. Me gusta probar y aprender nuevas tecnologías a medida que se van actualizando para comprobar si pueden ayudarme a optimizar mi trabajo y a su vez ofrecer mayor calidad.": "I have been developing web applications actively and professionally for about 6 years, I describe myself as someone quite analytical from a logical point of view. I like to try and learn new technologies as they are updated to see if they can help me optimize my work and in turn offer higher quality.",
  "Datos Personales": "Personal Data",
  "Cumpleaños": "Birthday",
  "Teléfono": "Phone",
  "Email": "Email",
  "Ubicación": "Location",
  "Status": "Status",
  "Contratado por": "Hired by",
  "Mis Intereses": "My Interests",
  "Juegos": "Games",
  "Viajes": "Travel",
  "Tecnología": "Technology",
  "Compras": "Shopping",
  "Big Data": "Big Data",
  "Comida": "Food",
  "Familia": "Family",
  "Arte": "Art",
  "Descargar CV": "Download CV",


  "Habilidades": "Skills",
  "Habilidades Técnicas": "Technical Skills",
  "Habilidades Personales": "Personal Skills",
  "Comunicación": "Communication",
  "Trabajo en equipo": "Teamwork",
  "Creatividad": "Creativity",
  "Concentración": "Concentration",
  "Aprendizaje": "Learning",
  "Resolución de Problemas": "Problem Solving",
  "Organización": "Organization",
  "Responsabilidad": "Responsibility",


  "Experiencia Laboral": "Work Experience",
  "Actualmente": "Currently",
  "Programador Web": "Web Developer",
  "Desarrollar aplicaciones web a medida, compatible con dispositivos móviles y SEO.": "Develop custom web applications, compatible with mobile devices and SEO.",
  "Desarrollar soluciones de e-commerse.": "Develop e-commerse solutions.",
  "Desarrollar aplicaciones para Android/IOS.": "Develop applications for Android / IOS.",
  "Analisis y resolución de problemas en códigos.": "Analysis and resolution of problems in codes.",
  "Gestión y mantenimiento de bases de datos MYSQL y SQL.": "Management and maintenance of MYSQL and SQL databases.",
  "Optimizar la seguridad de las APPs administradas.": "Optimize the security of the managed APPs.",
  "Creación de bot para hacer trade de criptomonedas (Web APP con Python)": "Creation of bot to trade cryptocurrencies (Web APP with Python)",
  "Desarrollar un algoritmo para detectar patrones financieros y enviar alertas de posibles operaciones a realizar.": "Develop an algorithm to detect financial patterns and send alerts of possible operations to be carried out.",
  "Implementación de Arbitrage entre más de 4 exchanges.": "Implementation of Arbitrage between more than 4 exchanges.",
  "Desarrollo de bot para Discord para comunicación directa con el cliente.": "Development of bot for Discord for direct communication with the client.",
  "Configuración de servidor Amazon AWS e implementación.": "Amazon AWS server configuration and implementation.",
  "Coordinador de Sala Situacional": "Situational Room Coordinator",
  "Desarrollar sistema automatizado para gestion de inventários (Aplicación web)": "Develop automated system for inventory management (Web application)",
  "Recolección, analisis y tratamiento de datos de todas las gerencias para presentar al presidente de la empresa": "Collection, analysis and treatment of data from all the management to present to the president of the company",
  "Asesorar a nivel tecnológico al Presidente de la Empresa": "Advise the President of the Company on a technological level",
  "Resolución de problemas técnicos": "Resolution of technical problems",
  "Admin. Sistemas": "Systems Admin.",
  "Mi trabajo principal consistía en velar por el buen funcionamiento del sistema de llamadas y reportes del CallCenter, resolución de problemas técnicos y reportes diarios.": "My main job was to ensure the proper functioning of the CallCenter's call and reporting system, resolution of technical problems and daily reports.",


  "Portafolio Reciente (Solo algunos ejemplos)": "Recent Portfolio (Only some examples)",
  "Tienda Online": "Online Store",
  "para": "for",
  "Módulo de pagos para": "Payment module for",
  "Página Web": "Web Page",
  "Módulo para": "Module for",
  "APP Android para gestión interna": "Android APP for internal management",


  "Su nombre": "Your name",
  "Teléfono": "Phone",
  "Su email": "Your email",
  "Asunto": "Subject",
  "Mensaje": "Message",
  "Enviar": "Send",


  "Esta web utiliza Cookies": "This website uses Cookies",
  "Personalizar": "Customize",
  "Aceptar todas": "Accept all",
  "Rechazar todas": "Reject all",
  "Guardar configuración": "Save configuration",
  "Ver cookies": "See cookies",
  "Cookies Técnicas": "Technical Cookies",
  "Hola, mi portafolio online utiliza algunas cookies para mejorar y optimizar el contenido que deseo mostrarte. No te preocupes, podrás volver a modificar tu configuración desde el footer de esta web cuando quieras.": "Hello, my online portfolio uses some cookies to improve and optimize the content that I want to show you. Don't worry, you can go back to modify your configuration from the footer of this website whenever you want.",
  "Estas cookies garantizan el buen funcionamiento de mi portafolio online, son usadas para ejecutar funciones vitales como por ejemplo la seguridad y la navegación. Por ese motivo son obligatorias.": "These cookies guarantee the proper functioning of my online portfolio, they are used to perform vital functions such as security and navigation. For that reason they are mandatory.",
  "Esta cookie es usada por Google Recaptcha, es necesaria para la seguridad y la integridad de mi portafólio online.": "This cookie is used by Google Recaptcha, it is necessary for the security and integrity of my online portfolio.",
  "Esta cookie es usada por mi portafolio online para recordar su desición sobre el uso de cookies y ajustar la web a su configuración de privacidad de datos.": "This cookie is used by my online portfolio to remember your decision about the use of cookies and adjust the website to your data privacy settings.",
  "Esta es una cookie de seguridad para firmar la cookie de política de cookies.": "This is a security cookie to sign the cookie policy cookie.",
  "Esta cookie es usada por Google Analytics para distinguir a los usuarios y me permite almacenar el numero de veces que mi portafolio online ha sido visitado.": "This cookie is used by Google Analytics to distinguish users and allows me to store the number of times my online portfolio has been visited.",
  "Son aquéllas que le permitirán acceder a mi portafolio online con algunas características predefinidas y que dependiendo de las características de su dispositiov y/o navegador, servirán para ofrecer un mejor servicio, sirven por ejemplo para configurar el idioma, para adaptar el contenido al navegador/dispositivo que está utilizando, para guardar su configuración regional, etc.": "They are those that will allow you to access my online portfolio with some predefined characteristics and that depending on the characteristics of your device and / or browser, they will serve to offer a better service, they serve for example to configure the language, to adapt the content to the browser / device you are using, to save your regional configuration, etc.",
  "Esta cookie propia de mi portafolio online y sirve para recordar el idioma que configuró.": "This own cookie of my online portfolio and serves to remember the language you configured.",
  "Cookies Analíticas": "Analytical Cookies",
  "Cookies de Personalización": "Personalization Cookies",
  "Detalles": "Details",


  "Revocar configuración de cookies": "Revoke cookie settings",

  "Módulo de pagos para Prestashop": "Payment module for Prestashop",
  "Easypay para Prestashop 1.7": "Easypay for Prestashop 1.7",
  "En este proyecto, he desarrollado un módulo de pagos en línea para Prestashop 1.7.x y 8.0.x, El módulo se conecta con el gateway de pagos de Easypay mediante su API, lo que brinda a los comerciantes la posibilidad de ofrecer diversas opciones de pago a sus clientes. El módulo admite diferentes modalidades de pago, como MBWAY, tarjeta de crédito, tarjeta de débito, transferencia bancaria y boleto. Además, he implementado una funcionalidad adicional que permite a los usuarios suscribirse a ciertos productos. Esta función se configura desde el panel de administración, lo que permite generar pagos automáticos periódicos según la configuración establecida. Una característica destacada es la flexibilidad que ofrece a los usuarios. Incluso después de que haya caducado el método de pago seleccionado durante el proceso de compra, los usuarios aún tienen la opción de cancelar sus suscripciones, cancelar pagos o volver a intentar el pago de sus órdenes. Este módulo de pagos en línea ofrece una solución integral y confiable para Prestashop, brindando una experiencia de compra fluida y conveniente tanto para los comerciantes como para los clientes. Estoy seguro de que puede ser una adición valiosa para cualquier negocio en línea.": "In this project, I have developed an online payment module for Prestashop 1.7.x and 8.0.x, The module connects with the Easypay payment gateway through its API, which gives merchants the possibility to offer various payment options to their customers. The module supports different payment modalities, such as MBWAY, credit card, debit card, bank transfer and ticket. In addition, I have implemented an additional functionality that allows users to subscribe to certain products. This function is configured from the administration panel, which allows generating automatic periodic payments according to the established configuration. A highlight is the flexibility it offers to users. Even after the selected payment method during the purchase process has expired, users still have the option to cancel their subscriptions, cancel payments or retry the payment of their orders. This online payment module offers a comprehensive and reliable solution for Prestashop, providing a smooth and convenient shopping experience for both merchants and customers. I am sure it can be a valuable addition to any online business.",
  "Gamershop - Tienda Online": "Gamershop - Online Store",
  "He creado una tienda online dirigida al público en general, con un enfoque principal en productos informáticos para gamers. El diseño de la tienda es moderno y atractivo, y para su desarrollo he utilizado el CMS Prestashop 1.7. Con el fin de mejorar la funcionalidad de la tienda, he desarrollado algunos módulos personalizados. Por ejemplo, he creado un módulo de búsqueda en tiempo real utilizando AJAX, lo que permite a los usuarios obtener resultados instantáneos mientras escriben en el campo de búsqueda. Además, he creado un módulo especial para ampliar las funciones de promociones, permitiendo al comerciante establecer nuevas reglas y características para las promociones de productos. También he desarrollado un módulo especial para los paquetes de productos, ya que la versión base de Prestashop no ofrecía las características necesarias para satisfacer las necesidades del comerciante. Además de estas mejoras, he realizado optimizaciones en el rendimiento de la tienda y he implementado un sistema de filtros de productos personalizado, diferente al que viene predeterminado en Prestashop. Esto permite a los usuarios encontrar rápidamente los productos que desean, facilitando su experiencia de compra. En resumen, esta tienda online que he desarrollado ofrece una experiencia de compra atractiva y funcional para los usuarios interesados en productos informáticos, especialmente enfocados en el mundo gamer.": "I have created an online store aimed at the general public, with a main focus on computer products for gamers. The store design is modern and attractive, and for its development I have used the CMS Prestashop 1.7. In order to improve the functionality of the store, I have developed some custom modules. For example, I have created a real-time search module using AJAX, which allows users to get instant results as they type in the search field. In addition, I have created a special module to extend the functions of promotions, allowing the merchant to set new rules and features for product promotions. I have also developed a special module for product packages, since the base version of Prestashop did not offer the necessary features to meet the merchant's needs. In addition to these improvements, I have made optimizations in the performance of the store and I have implemented a custom product filter system, different from the one that comes by default in Prestashop. This allows users to quickly find the products they want, making their shopping experience easier. In short, this online store that I have developed offers an attractive and functional shopping experience for users interested in computer products, especially focused on the gamer world.",
  "Trincanela - Tienda Online": "Trincanela - Online Store",
  "He desarrollado una tienda online dirigida al público en general, con un enfoque especial en la venta de productos alimentarios. Sin embargo, el principal objetivo de esta tienda es controlar la distribución de mercancía a las diferentes tiendas físicas de la empresa. El diseño de la tienda es moderno y atractivo, y para su desarrollo he utilizado el CMS Prestashop 1.7. Con el fin de garantizar un control eficiente de la distribución de mercancía, he desarrollado algunos módulos especiales. Por ejemplo, he creado un módulo interno que permite al comerciante aplicar diversos filtros y generar archivos en formato Excel y/o PDF. Estos archivos brindan al comerciante una visión organizada de la distribución diaria de mercancía que debe realizarse en cada una de las tiendas físicas, basada en los pedidos realizados por los administradores de cada tienda. Estas herramientas especiales proporcionan al comerciante una forma eficiente de gestionar y comprender la distribución de mercancía, facilitando la coordinación entre las diferentes tiendas físicas y optimizando el proceso logístico. En resumen, esta tienda online que he desarrollado se centra en la venta de productos alimentarios y está especialmente diseñada para controlar la distribución de mercancía a las tiendas físicas de la empresa.": "I have developed an online store aimed at the general public, with a special focus on the sale of food products. However, the main objective of this store is to control the distribution of merchandise to the different physical stores of the company. The store design is modern and attractive, and for its development I have used the CMS Prestashop 1.7. In order to guarantee an efficient control of the distribution of merchandise, I have developed some special modules. For example, I have created an internal module that allows the merchant to apply various filters and generate files in Excel and/or PDF format. These files provide the merchant with an organized view of the daily distribution of merchandise that must be carried out in each of the physical stores, based on the orders placed by the administrators of each store. These special tools provide the merchant with an efficient way to manage and understand the distribution of merchandise, facilitating coordination between the different physical stores and optimizing the logistics process. In short, this online store that I have developed focuses on the sale of food products and is specially designed to control the distribution of merchandise to the company's physical stores.",
  "Cuentas Corrientes de Primavera - Módulo Prestashop": "Cuentas Corrientes de Primavera - Prestashop Module",
  "He desarrollado un módulo para Prestashop que se integra fácilmente con el ERP Primavera. Este módulo muestra las cuentas pendientes y cuentas corrientes por cliente, facilitando el seguimiento de la información financiera. Además, ofrece la opción de descargar las facturas generadas por el software Primavera directamente desde la plataforma de administración de Prestashop. Asimismo, el módulo permite la descarga de un archivo Excel con los datos de las cuentas corrientes de los clientes, brindando una visión organizada y accesible de la información contable. Este módulo proporciona una solución eficiente para la gestión financiera en Prestashop, al permitir una integración fluida con el ERP Primavera y facilitar el acceso a datos clave de manera rápida y sencilla.": "I have developed a module for Prestashop that integrates easily with the ERP Primavera. This module shows the outstanding accounts and current accounts by customer, facilitating the follow-up of financial information. In addition, it offers the option to download the invoices generated by the Primavera software directly from the Prestashop administration platform. Likewise, the module allows the download of an Excel file with the data of the current accounts of the clients, providing an organized and accessible vision of the accounting information. This module provides an efficient solution for financial management in Prestashop, by allowing a seamless integration with the ERP Primavera and facilitating access to key data quickly and easily.",
  "Frusel - Tienda Online": "Frusel - Online Store",
  "He desarrollado una aplicación (APP) para el control de procesos internos relacionados con las operaciones de la empresa. Esta aplicación facilita la creación de formularios simples para que los trabajadores encargados de reportar la información puedan cargar los datos y registrarlos en la base de datos de manera rápida y sencilla. Durante el desarrollo de esta APP, hemos utilizado diversas tecnologías para satisfacer las necesidades específicas de nuestro cliente en términos de seguridad y funcionalidad. Como resultado, hemos complementado la aplicación con una API que he desarrollado. Esta API se encarga de actualizar los formularios, recibir la información enviada a través de ellos, almacenar los datos en la base de datos, enviar correos electrónicos, gestionar notificaciones y realizar otras funciones necesarias. La combinación de la aplicación y la API garantiza un proceso eficiente y seguro para el control de los procesos internos de la empresa.": "I have developed an application (APP) for the control of internal processes related to the company's operations. This application facilitates the creation of simple forms so that the workers in charge of reporting the information can load the data and register it in the database quickly and easily. During the development of this APP, we have used various technologies to meet the specific needs of our client in terms of security and functionality. As a result, we have complemented the application with an API that I have developed. This API is responsible for updating the forms, receiving the information sent through them, storing the data in the database, sending emails, managing notifications and performing other necessary functions. The combination of the application and the API guarantees an efficient and secure process for the control of the company's internal processes.",
  "He desarrollado una tienda online utilizando Prestashop que permite la venta de productos tanto por peso como por unidad. Dado que Prestashop no ofrece funcionalidades nativas para este tipo de compras, y no encontré ningún módulo desarrollado que cumpliera con estos requisitos, creé un módulo personalizado desde cero. Este módulo amplía las funciones y vistas de Prestashop para satisfacer las necesidades específicas del cliente en este aspecto. Además, la tienda online cuenta con un diseño moderno y atractivo, que es compatible con dispositivos móviles y está optimizado para SEO. Esto asegura una experiencia de usuario óptima y una mejor visibilidad en los motores de búsqueda.": "I have developed an online store using Prestashop that allows the sale of products both by weight and by unit. Since Prestashop does not offer native functionalities for this type of purchases, and I did not find any developed module that met these requirements, I created a custom module from scratch. This module extends the functions and views of Prestashop to meet the specific needs of the client in this aspect. In addition, the online store has a modern and attractive design, which is compatible with mobile devices and is optimized for SEO. This ensures an optimal user experience and better visibility in search engines."


}